jet_in_flow/2_pisoFoam_turbulent_nonmixing/mesh_20/U1_1_U2_4/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| turbulence properties                                                     |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //

