jet_in_flow/2_pisoFoam_turbulent_nonmixing/mesh_20/U1_1_U2_4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|  controlDict for incompressible laminar jet test (icoFoam)                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     pisoFoam;        // <-- this line defines the solver

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6;             // shorter runtime for initial test

deltaT          0.001;          // smaller timestep for stability

writeControl    timeStep;
writeInterval   100;            // write every 100 timesteps

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

