jet_in_flow/2_pisoFoam_turbulent_nonmixing/mesh_20/U1_1_U2_4/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// ************************************************************************* //
// Time discretisation
ddtSchemes
{
    default         Euler;
}

// Gradient schemes
gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
}

// Divergence schemes
divSchemes
{
    div(phi,U)                          Gauss upwind;
    div(phi,k)                          Gauss upwind;
    div(phi,omega)                      Gauss upwind;

    // viscous stress terms (needed by kOmegaSST)
    div((nuEff*dev(T(grad(U)))))        Gauss linear;
    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

// Laplacian schemes
laplacianSchemes
{
    default         Gauss linear corrected;
}

// Interpolation schemes
interpolationSchemes
{
    default         linear;
}

// Surface-normal gradient schemes
snGradSchemes
{
    default         corrected;
}

// Wall distance algorithm for turbulence model
wallDist
{
    method          meshWave;
}

// ************************************************************************* //

